package org.example.IceBreaking.enumData;

import lombok.Getter;

@Getter
public enum QuestionsByInterestKey {

    SPORTS(new String[]{
            "요새 즐기는 스포츠가 있나요?",
            "가장 자신있는 운동은?",
            "응원하는 야구팀이 있나요?",
            "응원하는 축구팀이 있나요?",
            "최근에 가장 인상깊게 본 스포츠 경기 장면은?",
            "가장 좋아하는 스포츠 선수와 그 이유는 무엇인가요?",
            "최근에 배워보고 싶은 스포츠가 있나요?",
            "스포츠 경기 직관해본 경험을 말해주세요!",
            "학창 시절 가장 좋아했던 스포츠는?"
    }),
    MOVIESANDDRAMA(new String[]{
            "추천하고 싶은 넷플릭스 영화 하나!",
            "가장 기억나는 영화 명장면면은?",
            "영화, 이런 장르만은 돈주고 보고 싶지 않다!",
            "똑같은 영화를 10번 봐야 한다면 어떤 영화를 보고싶은가요?",
            "가장 좋아하는 영화 장르는?",
            "자신의 인생 영화 말해주기",
            "공포 영화 못 보는 사람?",
            "추천하고 싶은 넷플릭스 드라마 하나!",
            "가장 기억나는 드라마 명장명은?",
            "자신의 인생 드라마 말해주기"
    }),
    MUSIC(new String[]{
            "최애가수 1명과 그 이유를 말해주세요!",
            "요새 내가 듣는 인생 노래 추천해주기",
            "나의 노래방 애창곡은?",
            "가장 좋아하는 노래 장르는?",
            "노래에서 멜로디 or 가사 중 더 중요하게 생각하는 것은?",
            "가장 기억에 남는 라이브나 콘서트는 무엇인가요?",
            "드라이브할 때 듣기 좋은 음악을 추천해주세요!",
            "음악을 들을 때 가장 선호하는 장소나 상황은 어떤 것인가요?",
            "가장 최근에 발견한 좋은 음악이나 아티스트가 있나요? 어떻게 발견하게 되었나요?"
    }),
    GAMES(new String[]{
            "최근에 즐겨하는 게임이 있나요? 그 게임의 매력은 무엇인가요?",
            "가장 좋아하는 게임 장르는 무엇인가요?",
            "롤 티어 어디세요?",
            "롤에서 당신의 포지션은?",
            "롤에서 가장 잘하는 챔피언은?",
            "응원하는 롤 팀이 있나요?"
    }),
    TRIP(new String[]{
            "최근 방문한 여행지 중 가장 마음에 들었던 곳을 추천해주세요!",
            "가고싶은 혹은 갔다왔던 페스티벌을 말해주세요!",
            "나와 잘 맞는 여행 메이트는 어떤 스타일인가요?",
            "여행 유형 J or P ?",
            "현재 가장 가고 싶은 꿈의 여행지를 말해주세요!",
            "혼자 여행과 친구/가족과의 여행 중 무엇을 더 선호하나요?",
            "여행지에서 꼭 해보고 싶은 액티비티는?",
            "여행할 때 꼭 챙기는 필수 아이템은 무엇인가요?",
            "여행 중 가장 기억에 남는 식사는 무엇이었나요?",
            "다음 여행 계획은 어디로 가고 싶으신가요?",
            "여행 중 겪었던 가장 재미있거나 기억에 남는 에피소드는 무엇인가요?"
    }),
    EATING(new String[]{
            "진라면 순한 맛 VS 매운 맛",
            "평생 한 가지 종류의 라면만 먹을 수 있다면?",
            "내가 서브웨이에 갔을 때 시키는 조합은?",
            "죽기전에 먹고 싶은 음식 1가지는 무엇인가요?",
            "베라에서 가장 좋아하는 맛은?",
            "민트초코 호,불호?",
            "하와이안 피자 호,불호?",
            "좋아하는 디저트가 있으신가요?",
            "요리를 자주 하시나요? 요리 실력을 말해주세요!",
            "좋아하는 커피 브랜드를 말해주세요",
            "매운 음식 잘드세요?",
            "나만 아는 숨겨진 맛집! 한 곳만 알려주실래요?"
    }),
    LOVE(new String[]{
            "고양이상과 강아지상 중 나의 취향은?",
            "꼭 한 번 해보고 싶은 데이트는?",
            "연애할 때, 중요도는 성격 VS 외모",
            "당신의 이상형은 무엇인가요?",
            "싸웠을 때, 시간이 필요한가요 당장 풀기를 원하나요?",
            "애정표현이 많은 편인가요?",
            "남사친/여사친과 1박 2일 여행가는 애인 VS 전애인과 술마시는 애인",
            "내가 추구하는 이상적인 연애에 대해 말해주세요",
            "내가 생각하는 연인과의 이상적인 데이트 횟수?"
    }),
    PET(new String[]{
            "키우고 있는 반려동물이나 키우고 싶은 반려동물은?",
            "반려동물의 이름은 무엇인가요?",
            "반려동물과 가장 좋아하는 활동은 무엇인가요?",
            "반려동물을 처음 만났을 때의 이야기를 해주세요.",
            "내 반려동물 자랑 한 가지!",
            "반려동물을 위해 특별히 준비하는 음식이나 간식이 있나요?",
            "반려동물과 여행을 가본 적이 있나요? 어디로 갔고, 그 경험은 어땠나요?"
    }),
    BALANCEGAMES(new String[]{
            "10살 나이로 평생 살기 VS 50살 나이로 평생 살기",
            "24시간 동안 밥 안 먹기 VS 잠 안 자기",
            "한여름에 전기장판 VS 한겨울에 창문 열기",
            "이틀 굶기 VS 3일 밤새기",
            "천재들 사이 자괴감 느끼기 VS 능력없는 팀원들 사이 캐리하기",
            "아메리카노 VS 라떼",
            "바로 로또 당첨 VS 수명 2배 살기",
            "어디로든 순간이동 초능력 VS 누구로든 변신가능 초능력"
    }),
    IF(new String[]{
            "평생 한 가지 종류의 라면만 먹을 수 있다면?",
            "3가지 소원을 빌 수 있다면 어떤 소원을 빌 건가요?",
            "지난 일주일 동안 일어난 일 중 한가지를 바꿀 수 있다면?",
            "초능력을 한 가지 가질 수 있다면 어떤 능력을 가지고 싶으신가요?",
            "로또 당첨되면 누구한테까지 말할 것인가요?",
            "팀원들을 보면 떠오르는 색깔을 말해주세요!",
            "지금 당장 100억이 생긴다면 어떻게 사용할 계획인가요?",
            "무인도에 홀로 남겨진다면 어떤 물건을 챙길 것인가요?",
            "닭과 달걀 중 무엇이 먼저라고 생각하나요?"
    });

    private final String[] questions;

    QuestionsByInterestKey(String[] questions) {
        this.questions = questions;
    }
}
